Merge pull request #4 from yueguobin/main
cleanup: remove inappropriate files and update copyright
